/*********************************************************************************************************
 **
 **                                    中国软件开源组织
 **
 **                                   嵌入式实时操作系统
 **
 **                                       SylixOS(TM)
 **
 **                               Copyright  All Rights Reserved
 **
 **--------------文件信息--------------------------------------------------------------------------------
 **
 ** 文   件   名: sntp.h
 **
 ** 创   建   人: Lu.ZhenPing (卢振平)
 **
 ** 文件创建日期: 2014 年 05 月 09 日
 **
 ** 描        述: sntp 主程序头文件.
 ********************************************************************************************************/
#ifndef __SNTP_H
#define __SNTP_H

#include <unistd.h>                                                       /*  unix系统调用相关          */
#include <string.h>                                                       /*  字符串处理                */
#include <time.h>                                                         /*  时间处理                  */
#include <sys/socket.h>                                                   /*  网络socket                */
#include <netdb.h>                                                        /*  网络地址                  */
#include <iniparser/iniparser.h>                                          /*  解析ini文件               */

/*********************************************************************************************************
**  宏定义                                                                                                                                                                                                                                                                                                  *
*********************************************************************************************************/
/*********************************************************************************************************
**  调试相关的宏                                                                                                                                                                                                                                                                                                  *
*********************************************************************************************************/
#define SNTP_DEBUG            (0)
#if (SNTP_DEBUG > 0)
#define SNTP_ERR(fmt, arg...) printf("%s:%d "fmt, __func__, __LINE__, ##arg)
#define SNTP_LOG              printf
#else
#define SNTP_ERR(fmt, arg...)
#define SNTP_LOG(fmt, arg...)
#endif                                                                    /*  SNTP_DEBUG > 0            */

#define SNTP_W_FILE           fprintf
#define SNTP_OPENLOG(fileName)                                            \
        fopen(fileName, "a+")
#define SNTP_CLOSELOG(fp)                                                 \
        fclose(fp)
#define SNTP_LOGHANDLE(fp, fmt, args...)                                  \
        do {                                                              \
            SNTP_W_FILE(fp, "%s:%d "fmt,                                  \
                        __func__, __LINE__, ##args);                      \
        } while (0)
#define SNTP_LOGHANDLE_F(fileName, fmt, args...)                          \
        do {                                                              \
           FILE *fp = SNTP_OPENLOG(fileName);                             \
           if (fp) {                                                      \
              SNTP_W_FILE(fp, "%s:%d "fmt,                                \
                          __func__, __LINE__, ##args);                    \
              SNTP_CLOSELOG(fp);                                          \
           }                                                              \
        } while (0)

#define SNTP_CONTAIN(a, b)    ((a) & (b))
#define SNTP_DEBUG_FILE       ("/tmp/sntp.log")

/*********************************************************************************************************
**  配置文件相关的宏                                                                                                                                                                                                                                                                                                  *
*********************************************************************************************************/
#define SNTP_CONF_PATH        ("/etc/sntp_cfg.ini")                       /*  SNTP配置文件路径          */
#define SNTP_ONE_MIN          (60)                                        /*  1分钟宏                   */
#define SNTP_NAME_LEN         (256)                                       /*  服务器地址缓冲大小        */

/*********************************************************************************************************
**  时间处理相关的宏                                                                                                                                                                                                                                                                                                  *
*********************************************************************************************************/
#define JAN_1970              (0x83AA7E80)                                /*  1900年到1970年的秒数      */
                                                                          /*  (3600*24*(70*365 + 17))   */
#define NTPFRAC(x)            (4294 * (x) + ((1981 * (x)) >> 11))
#define USEC(x)               (((x) >> 12) - \
                              (759 * ((((x) >> 10) + 32768) >> 16)))
#define SEC2USEC(x)           ((x) * 15.2587890625)
#define SNTP_PORT             (123)

/*********************************************************************************************************
**  SNTP包handle命令                                                                                                                                                                                                                                                                                                  *
*********************************************************************************************************/
#define SNTP_CMD_MASK         (0xFF)                                      /*  SNTP命令掩码              */
#define SNTP_CMD_INVALID      (0)                                         /*  SNTP无效的命令            */
#define SNTP_CMD_DEBUG        (1<<0)                                      /*  SNTP调试命令              */
#define SNTP_CMD_UPDATE_TIME  (1<<1)                                      /*  SNTP更新系统时间命令      */
#define SNTP_CMD_UPDATE_RTC   (1<<2)                                      /*  将系统时间写到RTC命令     */

/*********************************************************************************************************
**  接口宏替换                                                                                                                                                                                                                                                                                                  *
*********************************************************************************************************/
#define SNTP_GET_TIME         gettimeofday                                /*  得到系统时间              */
#define SNTP_SET_TIME         settimeofday                                /*  设置系统时间              */
#define SNTP_SYNC_RTC         sysToRtc                                    /*  系统时间同步到RTC         */

/*********************************************************************************************************
**  socket连接相关                                                                                                                                                                                                                                                                                                  *
*********************************************************************************************************/
#define SNTP_CONN_SUCC        (1)                                        /*  socket连接服务器成功标志   */
#define SNTP_CONN_FAIILED     (2)                                        /*  socket连接服务器失败标志   */

/*********************************************************************************************************
**
**                              SNTP 包(详细可参考doc/sntp.doc文档)
**   _________________________________________________________________________
**  |     |     |        |                |                |                  |
**  |  LI |  VN |  MODE  |   STRATUM      |      POLL      |    PRECISION     |
**  |_____|_____|________|________________|________________|__________________|
**  |                                                                         |
**  |                           Root Delay                                    |
**  |_________________________________________________________________________|
**  |                                                                         |
**  |                          Root Dispresion                                |
**  |_________________________________________________________________________|
**  |                                                                         |
**  |                        Reference Identifier                             |
**  |_________________________________________________________________________|
**  |                                                                         |
**  |                        ReferenceTimestamp                               |
**  |_________________________________________________________________________|
**  |                                                                         |
**  |                        OriginateTimestamp                               |
**  |_________________________________________________________________________|
**  |                                                                         |
**  |                         ReceiveTimestamp                                |
**  |_________________________________________________________________________|
**  |                                                                         |
**  |                        TransmitTimestamp                                |
**  |_________________________________________________________________________|
**  |                                                                         |
**  |                            optional                                     |
**  |_________________________________________________________________________|
**
**  LI:                  闰秒标示(2bit)
**  VN:                  SNTP版本号(3bit)
**  MODE:                模式(3bit)
**  STRATUM:             服务器工作的级别(8bit)
**  POLL:                数据包最大时间间隔(8bit)
**  PRECISION:           系统时钟的精确性(8bit)
**  RootDelay:           指示与服务器主时钟参考源的总共往返延迟,秒为单位(32bit)
**  RootDispersion：     指示与服务器主时钟参考源的时间差值,以秒为单位(32bit)
**  ReferenceIdentifier：指示时钟参考源的标记,该字段只在服务器端有效(32bit)
**  ReferenceTimestamp： 指示系统时钟最后一次校准的时间(64bit)
**  OriginateTimestamp： 指示客户向服务器发起请求的时间(64bit)
**  ReceiveTimestamp:    指示服务器接收到客户端请求的时间(64bit)
**  TransmitTimestamp：  指示服务器向客户发时间戳的时间(64bit)
**  optional             可选                                                                                                                                                                                                                                                                           *
*********************************************************************************************************/
#define LI                    (0)                                         /*  无警告                    */
#define VN                    (3)                                         /*  第三个版本(V3)            */
#define MODE                  (3)                                         /*  客户端模式                */
#define STRATUM               (0)                                         /*  故障信息                  */
#define POLL                  (4)                                         /*  时间间隔2^4秒             */
#define PREC                  (-6)                                        /*  时间精确度2^(-6)          */

/*********************************************************************************************************
**  数据结构定义                                                                                                                                                                                                                                                                                                  *
*********************************************************************************************************/
typedef struct {
    UINT32          NTT_uiCorase;                                         /*  时间戳整数部分　　　　　　*/
    UINT32          NTT_uiFine;                                           /*  时间戳小数部分            */
} SNTP_TIME;                                                              /*  SNTP时间戳格式            */

struct sntp_time_pkt {
    UINT32          NTTP_uiPktHdr;                                        /*  SNTP时间包头              */
    UINT32          NTTP_uiRootDelay;                                     /*  包往返延时                */
    UINT32          NTTP_uiRootDispersion;                                /*  客户端与服务器时钟差值    */
    UINT32          NTTP_uiRefId;                                         /*  时钟参考源的标记          */
    SNTP_TIME       NTTP_nttRefTimestamp;                                 /*  参考时间戳服务器侧        */
    SNTP_TIME       NTTP_nttOrigTimestamp;                                /*  源时间戳客户端侧          */
    SNTP_TIME       NTTP_nttRecvTimestamp;                                /*  接收时间戳服务器侧        */
    SNTP_TIME       NTTP_nttTransTimestamp;                               /*  发送时间戳服务器向客户发  */
} __attribute__((packed));

typedef struct sntp_time_pkt SNTP_TIME_PKT;

/*********************************************************************************************************
**  配置文件相关                                                                                                                                                                                                                                                                                                  *
*********************************************************************************************************/
typedef struct {
    CHAR            NTCFG_cHostName[SNTP_NAME_LEN];                       /*  服务器地址                */
} SNTP_CFG_BODY;

/*********************************************************************************************************
**  函数声明                                                                                                                                                                                                                                                                                                  *
*********************************************************************************************************/
INT  sntpMain(VOID);
INT  sntpDumpPkt(INT  iDebug, PCHAR  pcFileName, SNTP_TIME_PKT  *pnttpPkt);
INT  sntpLog(FILE  *fp, PCHAR  pcFmt, ...);

/*********************************************************************************************************
**  SNTP错误码                                                                                                                                                                                                                                                                                                  *
*********************************************************************************************************/
#define SNTP_PX_ERR           (PX_ERROR)                                   /*  一般性错误               */
#define SNTP_NO_ERR           (ERROR_NONE)                                 /*  没有错误                 */

enum {
    SNTP_READ_CONF_ERR = 1,                                                /*  读配置文件错误           */
    SNTP_SOCK_ERR,                                                         /*  打开socket错误           */
    SNTP_NO_CFG_FILE_ERR,                                                  /*  没有发现配置文件         */
    SNTP_NULL_POINTER_ERR,                                                 /*  空指针错误               */
};

#endif                                                                     /*  __SNTP_H                 */
/*********************************************************************************************************
  END
*********************************************************************************************************/
